In [7]:
# import dependencies
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from config import pw

In [8]:
# create connection to database engine
engine = create_engine("postgresql://postgres:"+pw+"@localhost:5432/sql_hw")
conn = engine.connect()

In [9]:
# read salary info from sql
salary_info = pd.read_sql("SELECT * FROM salaries", conn)
salary_info.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [10]:
# read title info from sql
title_info = pd.read_sql("SELECT * FROM titles", conn)
title_info.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [11]:
# merge salary and title info into one table
new_df = pd.merge(salary_info, title_info, on="emp_no", how="inner")
new_df.head()

,emp_no,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,65828,1996-08-03,1997-08-03,Staff,1996-08-03,9999-01-01
2,10003,40006,1995-12-03,1996-12-02,Senior Engineer,1995-12-03,9999-01-01
3,10004,40054,1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,40054,1986-12-01,1987-12-01,Senior Engineer,1995-12-01,9999-01-01

In [12]:
# calculate average salary for each job title
avgsalary = round(new_df.groupby("title")["salary"].mean(),2)
avgsalary_df = avgsalary.to_frame().reset_index()
avgsalary_df

                title    salary
0  Assistant Engineer  48493.20
1            Engineer  48539.78
2             Manager  51531.04
3     Senior Engineer  48506.75
4        Senior Staff  58503.29
5               Staff  58465.27
6    Technique Leader  48580.51

In [ ]:
# set x, y & tick locations
x = avgsalary_df["title"]
ticks = np.arange(len(x))
y = avgsalary_df["salary"]
 
# create bar chart
plt.bar(x, y, align="center", alpha=0.5, color=["blue"])

plt.xticks(ticks, x, rotation=90)
plt.ylabel("Salary (USD)")
plt.xlabel("Job Title")
plt.title("Average Salary by Title")

# save figure
plt.savefig("avg_salary.png")

# show figure
plt.show()